app/Models/ModelTransaksi.php

INSERT INTO `transaksi` (`idtransaksi`, `idpel`, `idharga`, `meterbulanini`, `meterbulanlalu`, `tglbayar`) VALUES (NULL, 'P001', 'P002', '100000', '50000', '2024-01-03')
---
   public function insertData($data)
   {
    $this->db->table('transaksi')->insert($data);